package Module10;

public class Introduction {
    /*
    模块十重点:
  1.知道继承的好处
  2.会使用继承
  3.知道继承之后成员变量以及成员方法的访问特点
  4.会方法的重写,以及知道方法重写的使用场景
  5.会使用this关键字调用当前对象中的成员
  6.会使用super关键字调用父类中的成员
  7.会定义抽象方法以及抽象类
  8.会重写抽象方法
     */

    /*
    1.父类怎么形成的:我们的定义了多个类,发现这些类中有很多重复性的代码,
    我们就定义了一个父类,将相同的代码抽取出来放到父类中,其他的类直接继承这个父类,就可以直接使用父类中的内容了

    2.怎么去继承: extends
    子类 extends 父类

    3.注意:
  a.子类可以继承父类中私有和非私有成员,但是不能使用父类中私有成员
  b.构造方法不能继承

    4.继承怎么学:
   a.继承不要从是否"拥有"方面来学习
     要从是否能"使用"方面来学习
     */
}
