package demo07_Object_oriented;

public class demo07_entity_class {
    /*
    1.测试类:带main方法的类,主要是运行代码的
    2.实体类:是一类事物的抽象表示形式
    世间万物的分类:比如: 人类   狗类   猫类   鼠标类
     */
    /*
    组成部分:
  1.属性(成员变量):这一类事物有啥
    a.定义位置:类中方法外
    b.作用范围:作用于当前类
    c.定义格式: 数据类型 变量名
    d.默认值:
      整数:0
      小数:0.0
      字符:'\u0000'
      布尔:false
      引用:null

  2.行为(成员方法):这一类事物都能干啥
    只需要将模块六所学的方法中的static干掉,其他的都一样
     */

//同一个包下面的类 互相之间使用 不需要导包
//    如果两个类在同一个包下,想要使用对方的成员不需要导包
//    如果两个类不在同一个包下,想要使用对方的成员需要导包
//    特殊包:java.lang -> 使用lang包下的类不需要导包 -> String

    /*
      b.创建对象:想要使用哪个类中的成员,就new哪个类的对象
    类名 对象名 = new 类名() -> 比如: Person person = new Person()
     */
}
